Процедура ДобавитьРеквизитыФормы(Форма) Экспорт

	ИмяФормы = Форма.ИмяФормы;
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
	    ДобавитьКонтактноеЛицо(Форма,Форма.Элементы.ГруппаШапкаПраво);
	иначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
	    ДобавитьКонтактноеЛицо(Форма,Форма.Элементы.ГруппаШапкаПраво);
	иначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
	    ДобавитьКонтактноеЛицо(Форма,Форма.Элементы.ГруппаШапкаПраво);
	иначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
	    ВставитьКонтактноеЛицо(Форма,Форма.Элементы.СуммаДокумента);
	иначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
	    ВставитьКонтактноеЛицо(Форма,Форма.Элементы.СуммаДокумента);
	КонецЕсли;

КонецПроцедуры


Процедура ДобавитьКонтактноеЛицо(Форма, ГруппаЭлементов)
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо",Тип("ПолеФормы"),ГруппаЭлементов);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.он_КонтактноеЛицо";  
	СвязатьСКонтрагентом(ПолеВвода);
КонецПроцедуры    

Процедура ВставитьКонтактноеЛицо(Форма, СледующийЭлемент)
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо",Тип("ПолеФормы"),,СледующийЭлемент);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.он_КонтактноеЛицо";  
	СвязатьСКонтрагентом(ПолеВвода);
КонецПроцедуры    



Процедура СвязатьСКонтрагентом(ПолеВвода) 
	//https://www.koderline.ru/expert/instruktsii/article-svyazi-parametrov-vybora-v-1s/#jakor4
	НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Контрагент");
	МассивСвязей = Новый Массив;
	МассивСвязей.Добавить(НоваяСвязь);
	НовыеСвязи = Новый ФиксированныйМассив(МассивСвязей);   
	ПолеВвода.СвязиПараметровВыбора = НовыеСвязи;

КонецПроцедуры
